In [2]:
import pandas as pd 

india_weather = pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[25,32,17],
    "humidity":[80,60,70]
})
india_weather

        city  temperature  humidity
0     mumbai           25        80
1      delhi           32        60
2  bangalore           17        70

In [3]:
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[14,8,36],
    "humidity":[25,32,35]
})
us_weather

       city  temperature  humidity
0  new york           14        25
1   chicago            8        32
2   orlando           36        35

In [7]:
new_df = pd.concat([india_weather,us_weather],keys=["india",'US'])
new_df

              city  temperature  humidity
india 0     mumbai           25        80
      1      delhi           32        60
      2  bangalore           17        70
US    0   new york           14        25
      1    chicago            8        32
      2    orlando           36        35

In [8]:
new_df = pd.concat([india_weather,us_weather], ignore_index=True)
new_df

        city  temperature  humidity
0     mumbai           25        80
1      delhi           32        60
2  bangalore           17        70
3   new york           14        25
4    chicago            8        32
5    orlando           36        35

#### What if , there is some data is missing or there is a difference in indexing
> **Then, we have to fixed indexing in DataFrame**

In [15]:
weather1 = pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[25,32,17],
},index=[0,1,2])
weather1

        city  temperature
0     mumbai           25
1      delhi           32
2  bangalore           17

In [16]:
weather2 = pd.DataFrame({
    "city":["delhi","mumbai"],
    "humidity":[60,80]
},index=[1,0])
weather2

     city  humidity
1   delhi        60
0  mumbai        80

In [17]:
new_df = pd.concat([weather1,weather2], axis=1)
new_df

        city  temperature    city  humidity
0     mumbai           25  mumbai      80.0
1      delhi           32   delhi      60.0
2  bangalore           17     NaN       NaN

#### Lets try to concat extra column in a dataframe

In [18]:
events = pd.Series(["Rain","Sunny","Clouds"],name="Event")
events

0      Rain
1     Sunny
2    Clouds
Name: Event, dtype: object

In [20]:
new_df = pd.concat([weather1,events] , axis=1)
new_df

        city  temperature   Event
0     mumbai           25    Rain
1      delhi           32   Sunny
2  bangalore           17  Clouds